/datum/job/submap/armsfactory_loyalengi/get_description_blurb()
	return "Ты - оружейник завода, принадлежащего Лорданианской Республиканской Армиии, мятежным силам в стане Суверенной Лордании.\
	Ты собственным потом и кровью подкидываешь дрова в костёр революции, снабжая наших соратников самым надёжным и самым качественным оружием.\
	Если считаете, что республиканское имущество может быть перепродано за кругленькую сумму сомнительным элементам - вы правы!\
	Вам крупно повезёт, если вы сможете установить контакт с нашими братьями из Сола,\
	не забудьте сделать им скидку, мы должны оказать братский приём тем, кто помогает Республиканской Армии."

/datum/job/submap/armsfactory_loyalguard/get_description_blurb()
	return "Ты - охранник оружейного завода, принадлежащего Лорданианской Республиканской Армии, мятежным силам в стане Суверенной Лордании.\
	Твоя работа не самая сложная среди тех, которые тебе могли поручить, ты лишь ходишь с грозным видом и обеспечиваешь безопасность своих соратников\
	и, собственно, свою собственную, от посягательств рабов ущербных терранцев, ну и всех остальных, не менее ущербных ксеносов.\
	Всяких космических странников тебе не составит труда выгнать пинком под зад, но при полномаштабном штурме твоей задачей будет спасение оружейника,\
	максимального количества оборудования, а потом уже и своей шкуры. Если повезёт, то с этим всем помогут братья из Сола."
